# Pandas Dataframe Eleman İşlemleri

In [1]:
import pandas as pd
import numpy as np

In [6]:
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)
s4 = np.random.randint(10, size=5)
s5 = np.random.randint(10, size=5)

In [7]:
sozluk = {"var1":s1,"var2":s2,"var3":s3,"var4":s4, "var5":s5}

In [62]:
df1 = pd.DataFrame(sozluk, index=["a","b","c","d","e"])
df1

   var1  var2  var3  var4  var5
a     5     7     6     0     6
b     2     5     1     3     5
c     6     4     6     4     1
d     9     6     1     8     6
e     0     2     7     7     0

In [63]:
df1["c":"e"]

   var1  var2  var3  var4  var5
c     6     4     6     4     1
d     9     6     1     8     6
e     0     2     7     7     0

## Silme İşlemi:

In [64]:
df2 = pd.DataFrame(sozluk, index=["a","b","c","d","e"])

In [67]:
df2.drop("a", axis=0)

#Geçici işlemdir df1 aynı kalır.

   var1  var2  var3  var4  var5
b     2     5     1     3     5
c     6     4     6     4     1
d     9     6     1     8     6
e     0     2     7     7     0

In [69]:
#Silme işleminin kalıcı olması için "inplace" argümanını kullanırız.
df2.drop("a", axis=0, inplace=True)
df2

   var1  var2  var3  var4  var5
b     2     5     1     3     5
c     6     4     6     4     1
d     9     6     1     8     6
e     0     2     7     7     0

## Fancy İle Silme İşlemi:

In [45]:
df3 = pd.DataFrame(sozluk, index=["a","b","c","d","e"])

In [46]:
l = ["b","e"]

In [47]:
df3.drop(l, axis=0, inplace=True)
df3

   var1  var2  var3  var4  var5
a     5     7     6     0     6
c     6     4     6     4     1
d     9     6     1     8     6

## Sorgulama İşlemleri:

In [56]:
df4 = pd.DataFrame(sozluk, index=["a","b","c","d","e"])
df4

   var1  var2  var3  var4  var5
a     5     7     6     0     6
b     2     5     1     3     5
c     6     4     6     4     1
d     9     6     1     8     6
e     0     2     7     7     0

In [59]:
liste =["var1","var2","var6","var3"]

In [60]:
"var1" in df4

True

In [61]:
for i in liste:
    print(i in df4)

True
True
False
True

## Değişken Oluşturma:

In [75]:
df4 = pd.DataFrame(sozluk, index=["a","b","c","d","e"])
df4

   var1  var2  var3  var4  var5
a     5     7     6     0     6
b     2     5     1     3     5
c     6     4     6     4     1
d     9     6     1     8     6
e     0     2     7     7     0

In [76]:
#Dataframe'in ismini köşeli parantez ile yazıp içine değişkenin ismini yazdığımızda değişkenin değerlerine ulasabiliriz.

df4["var2"]

a    7
b    5
c    4
d    6
e    2
Name: var2, dtype: int32

In [77]:
#Yeni bir eleman oluşturmak ise gayet düz mantık şeklindedir.
#Oluşturmak istediğimiz elemanın ismini köşeli parantez ile yazıp değerlerini gireriz.
df4["yeniEleman1"]= df4["var1"]*df4["var4"]
df4

   var1  var2  var3  var4  var5  yeniEleman1
a     5     7     6     0     6            0
b     2     5     1     3     5            6
c     6     4     6     4     1           24
d     9     6     1     8     6           72
e     0     2     7     7     0            0

In [79]:
df4["yeniEleman2"]=["Lenovo","Asus","Dell","Hp","MSI"]
df4

   var1  var2  var3  var4  var5  yeniEleman1 yeniEleman2
a     5     7     6     0     6            0      Lenovo
b     2     5     1     3     5            6        Asus
c     6     4     6     4     1           24        Dell
d     9     6     1     8     6           72          Hp
e     0     2     7     7     0            0         MSI

## Değişken Silme:

Yine **drop** metodunu kullanacağız.

In [81]:
df5 = pd.DataFrame(sozluk, index=["a","b","c","d","e"])
df5

   var1  var2  var3  var4  var5
a     5     7     6     0     6
b     2     5     1     3     5
c     6     4     6     4     1
d     9     6     1     8     6
e     0     2     7     7     0

In [84]:
df5.drop("var2", axis = 1) #inplace=true yazmadığımız için kaydedilmeyecek.
#Sütunu sildiğimiz için axis' e 1 değerini atadık.

   var1  var3  var4  var5
a     5     6     0     6
b     2     1     3     5
c     6     6     4     1
d     9     1     8     6
e     0     7     7     0

In [85]:
#Yine fancy kullanarak da değişken silebiliriz.
k=["var3","var5"]
df5.drop(k, axis = 1) #inplace=true yazmadığımız için kaydedilmeyecek.

   var1  var2  var4
a     5     7     0
b     2     5     3
c     6     4     4
d     9     6     8
e     0     2     7